app/controllers/articles_controller.rb

  def create
    Article.populate(article_params, current_user)
    @articles = Article.where(user_id = current_user.id)
    @article = Article.last
    respond_to do |format|
    if @article.save
---
SELECT "articles".* FROM "articles" WHERE (1)
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 1
INSERT INTO "articles" ("title", "tweet_1", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Asdfadsfadsfadsf"], ["tweet_1", "No tweet :/"], ["user_id", 1], ["created_at", "2015-09-24 00:47:34.168124"], ["updated_at", "2015-09-24 00:47:34.168124"]]

  def index
    @articles = Article.where(user_id = current_user.id)
---
SELECT "articles".* FROM "articles" WHERE (1)

  def refresh
    current_user.articles.map do |article|
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]

  def destroy
    Article.destroy(params[:id])
    @articles = Article.where(user_id = current_user.id)
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]