app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def create
    @article = Article.populate(article_params)
    if @article
      @articles = Article.all