app/controllers/sessions_controller.rb

  def create
    @user = User.find_or_create_from_auth_hash(auth_hash)
    session[:user_id] = @user.id
    @articles = Article.where(user_id = current_user.id)
---
INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["provider", "twitter"], ["uid", "3241893952"], ["created_at", "2015-09-23 13:28:24.622104"], ["updated_at", "2015-09-23 13:28:24.622104"]]
SELECT "articles".* FROM "articles" WHERE (1)